### Goal


### Licence

The code in the notebook is licensed under standard [MIT licence](https://github.com/ManasaSRonur/data-512-project/blob/main/LICENSE).

In [76]:
import pandas as pd
import numpy as np

In [77]:
asthma_df = pd.read_csv('input_files/asthma-county.csv')
asthma_df.head()

,Fips,County,Topic,Year,Count,Crude Rate,State Count,State Crude Rate
0,55001,Adams,Emergency Department Visits,2002,82,40.30,25844,47.45
1,55001,Adams,Emergency Department Visits,2003,93,45.84,27025,49.34
2,55001,Adams,Emergency Department Visits,2004,70,34.47,24992,45.35
3,55001,Adams,Emergency Department Visits,2005,57,27.60,25532,46.07
4,55001,Adams,Emergency Department Visits,2006,53,25.80,23791,42.70

In [78]:
asthma_df = asthma_df[asthma_df['County'] == 'Dane']
asthma_df.head()

,Fips,County,Topic,Year,Count,Crude Rate,State Count,State Crude Rate
264,55025,Dane,Emergency Department Visits,2002,1252,28.23,25844,47.45
265,55025,Dane,Emergency Department Visits,2003,1291,28.71,27025,49.34
266,55025,Dane,Emergency Department Visits,2004,1182,25.92,24992,45.35
267,55025,Dane,Emergency Department Visits,2005,1161,25.12,25532,46.07
268,55025,Dane,Emergency Department Visits,2006,998,21.29,23791,42.70

In [79]:
asthma_df['Topic'].unique()

array(['Emergency Department Visits', 'Hospitalizations'], dtype=object)

In [80]:
asthma_df = asthma_df[['Topic', 'Year', 'Count', 'Crude Rate']]

# Pivoting the dataframe
pivot_df = asthma_df.pivot_table(index=['Year'], 
                                 columns='Topic', 
                                 values=['Count', 'Crude Rate'], 
                                 aggfunc='sum')

# Flattening the multi-level columns
pivot_df.columns = ['ER_count', 'Hosp_count', 'ER_crude_rate', 'Hosp_crude_rate']

pivot_df = pivot_df.reset_index()

asthma_df = pivot_df

asthma_df.head()

   Year  ER_count  Hosp_count  ER_crude_rate  Hosp_crude_rate
0  2000       NaN       366.0            NaN             8.54
1  2001       NaN       344.0            NaN             7.89
2  2002    1252.0       299.0          28.23             6.74
3  2003    1291.0       315.0          28.71             7.01
4  2004    1182.0       284.0          25.92             6.23

In [81]:
# Calculate Total Crude Rate
asthma_df['Illness_crude_rate'] = np.where(
    asthma_df['ER_count'].isna(),  # To handle null values in ER_count
    asthma_df['Hosp_crude_rate'],  # Use Hosp_crude_rate as Total_crude_rate in this case
    ( 
        (asthma_df['ER_crude_rate'] * asthma_df['ER_count']) +
        (asthma_df['Hosp_crude_rate'] * asthma_df['Hosp_count'])
    ) / (asthma_df['ER_count'] + asthma_df['Hosp_count'])
)

asthma_df = asthma_df[['Year','Illness_crude_rate']]
asthma_df.head()

   Year  Illness_crude_rate
0  2000            8.540000
1  2001            7.890000
2  2002           24.087182
3  2003           24.453773
4  2004           22.105566

In [82]:
copd_df = pd.read_csv('input_files/copd-county.csv')
copd_df.head()

,FIPS,COUNTY,TOPIC,YEAR,COUNT,CRUDERATE,ST_COUNT,ST_CRUDERATE
0,55001,Adams,Emergency Department Visits,2002,139,90.53,16086,45.51
1,55001,Adams,Emergency Department Visits,2003,93,60.32,16118,45.23
2,55001,Adams,Emergency Department Visits,2004,63,40.50,15446,42.95
3,55001,Adams,Emergency Department Visits,2005,118,73.70,17393,47.90
4,55001,Adams,Emergency Department Visits,2006,102,63.37,16394,44.74

In [83]:
copd_df = copd_df[copd_df['COUNTY'] == 'Dane']
copd_df.head()

,FIPS,COUNTY,TOPIC,YEAR,COUNT,CRUDERATE,ST_COUNT,ST_CRUDERATE
252,55025,Dane,Emergency Department Visits,2002,780,28.12,16086,45.51
253,55025,Dane,Emergency Department Visits,2003,747,26.55,16118,45.23
254,55025,Dane,Emergency Department Visits,2004,802,28.08,15446,42.95
255,55025,Dane,Emergency Department Visits,2005,780,26.87,17393,47.90
256,55025,Dane,Emergency Department Visits,2006,723,24.45,16394,44.74

In [84]:
copd_df = copd_df[['TOPIC', 'YEAR', 'COUNT', 'CRUDERATE']]

# Pivoting the dataframe
pivot_df = copd_df.pivot_table(index=['YEAR'], 
                                 columns='TOPIC', 
                                 values=['COUNT', 'CRUDERATE'], 
                                 aggfunc='sum')

# Flattening the multi-level columns
pivot_df.columns = ['ER_count', 'Hosp_count', 'ER_crude_rate', 'Hosp_crude_rate']
pivot_df = pivot_df.reset_index()
copd_df = pivot_df
copd_df.head()

#  Calculate Total Crude Rate with condition to handle NaN in ER_count
copd_df['Illness_crude_rate'] = np.where(
    copd_df['ER_count'].isna(),  # To handle null values in ER_count
    copd_df['Hosp_crude_rate'],  # Use Hosp_crude_rate as Total_crude_rate in this case
    ( 
        (copd_df['ER_crude_rate'] * copd_df['ER_count']) +
        (copd_df['Hosp_crude_rate'] * copd_df['Hosp_count'])
    ) / (copd_df['ER_count'] + copd_df['Hosp_count'])
)

copd_df = copd_df[['YEAR','Illness_crude_rate']]
copd_df = copd_df.rename(columns={'YEAR': 'Year'})
copd_df.head()

   Year  Illness_crude_rate
0  2000           14.260000
1  2001           13.900000
2  2002           23.530327
3  2003           22.147407
4  2004           23.271017

In [85]:
tb_df = pd.read_csv('input_files/tb-county.csv')
tb_df.head()

  County  Year  Cases
0  Adams  2014      0
1  Adams  2015      0
2  Adams  2016      0
3  Adams  2017      0
4  Adams  2018      0

In [86]:
tb_df = tb_df[tb_df['County'] == 'Dane']
tb_df = tb_df[['Year','Cases']]
tb_df = tb_df.rename(columns={'Cases': 'Cases_tb'})
tb_df.head()

    Year  Cases_tb
30  2014         7
31  2015         7
32  2016         8
33  2017         8
34  2018         7

In [87]:
mortality_df = pd.read_csv('input_files/IHME-GBD_2021_DATA.csv')
mortality_df.head()

,measure,location,sex,age,cause,metric,year,val,upper,lower
0,Deaths,Wisconsin,Both,All ages,Tuberculosis,Number,1980,35.266869,38.254764,32.048993
1,Deaths,Wisconsin,Both,All ages,Tuberculosis,Percent,1980,0.000874,0.000945,0.000796
2,Deaths,Wisconsin,Both,All ages,Chronic obstructive pulmonary disease,Number,1980,1054.947563,1124.271566,972.031609
3,Deaths,Wisconsin,Both,All ages,Chronic obstructive pulmonary disease,Percent,1980,0.026140,0.027665,0.024102
4,Deaths,Wisconsin,Both,All ages,Asthma,Number,1980,57.460534,61.718510,53.305347

In [88]:
mortality_df['metric'].unique()

array(['Number', 'Percent'], dtype=object)

In [89]:
mortality_df['cause'].unique()

array(['Tuberculosis', 'Chronic obstructive pulmonary disease', 'Asthma'],
      dtype=object)

In [90]:
# Pivoting the dataframe
pivot_df = mortality_df.pivot_table(index=['year'], 
                                    columns=['cause', 'metric'], 
                                    values='val', 
                                    aggfunc='first')  # Using 'first' in case there are duplicate rows

# Renaming the columns to create desired names
pivot_df.columns = [f'{cause}_{metric}' for cause, metric in pivot_df.columns]

# If you want to update mortality_df with the renamed columns
mortality_df = pivot_df

# Resetting the index to make it a regular dataframe again
pivot_df = pivot_df.reset_index()

mortality_df = pivot_df
mortality_df.head()

,year,Asthma_Number,Asthma_Percent,Chronic obstructive pulmonary disease_Number,Chronic obstructive pulmonary disease_Percent,Tuberculosis_Number,Tuberculosis_Percent
0,1980,57.460534,0.001424,1054.947563,0.026140,35.266869,0.000874
1,1981,59.622550,0.001468,1078.169378,0.026540,33.512861,0.000825
2,1982,64.534687,0.001598,1131.218451,0.028009,32.036546,0.000793
3,1983,68.299677,0.001683,1239.013198,0.030531,31.014337,0.000764
4,1984,71.907332,0.001744,1316.450817,0.031926,29.699892,0.000720

In [91]:
mortality_df = mortality_df.rename(columns={
    'Chronic obstructive pulmonary disease_Percent': 'Death_percent_copd',
    'Tuberculosis_Percent': 'Death_percent_tb',
    'Asthma_Percent': 'Death_percent_asthma',
    'year': 'Year'
})
mortality_df = mortality_df[['Year', 'Death_percent_asthma', 'Death_percent_tb','Death_percent_copd' ]]
mortality_df.head()

   Year  Death_percent_asthma  Death_percent_tb  Death_percent_copd
0  1980              0.001424          0.000874            0.026140
1  1981              0.001468          0.000825            0.026540
2  1982              0.001598          0.000793            0.028009
3  1983              0.001683          0.000764            0.030531
4  1984              0.001744          0.000720            0.031926

In [92]:

merged_df = asthma_df.merge(copd_df, on='Year', how='outer', suffixes=('_asthma', '_copd'))

merged_df = merged_df.merge(tb_df, on='Year', how='outer')

merged_df = merged_df.merge(mortality_df, on='Year', how='outer')

merged_df.head()

,Year,Illness_crude_rate_asthma,Illness_crude_rate_copd,Cases_tb,Death_percent_asthma,Death_percent_tb,Death_percent_copd
0,1980,NaN,NaN,NaN,0.001424,0.000874,0.026140
1,1981,NaN,NaN,NaN,0.001468,0.000825,0.026540
2,1982,NaN,NaN,NaN,0.001598,0.000793,0.028009
3,1983,NaN,NaN,NaN,0.001683,0.000764,0.030531
4,1984,NaN,NaN,NaN,0.001744,0.000720,0.031926

In [93]:

merged_df.to_csv('intermediary_files/respiratory_illness_mortality_data.csv', index=False)